{"class_name": "Model", "config": {"output_layers": [["dense_2", 0, 0]], "name": "model", "layers": [{"class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 784], "dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "dtype": "float32", "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "use_bias": true, "name": "dense", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activation": "relu", "batch_input_shape": [null, 784]}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "dense"}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.95, "seed": null}, "inbound_nodes": [[["dense", 0, 0, {}]]], "name": "dropout"}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "dtype": "float32", "units": 256, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activation": "relu", "batch_input_shape": [null, 784]}, "inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.95, "seed": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "dtype": "float32", "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"dtype": "float32", "seed": null}}, "use_bias": true, "name": "dense_2", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "activation": "softmax", "batch_input_shape": [null, 784]}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2"}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.1.6-tf"}